Revit 2027 API
Element.GetMonitoredLocalElementIds Method
 Provides the local element IDs when the element is monitoring.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetMonitoredLocalElementIds()
Public Function GetMonitoredLocalElementIds As IList(Of ElementId)
public:
IList<ElementId^>^ GetMonitoredLocalElementIds()
member GetMonitoredLocalElementIds : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The IDs of local element IDs being monitored by this element.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace